In [ ]:
# De momento hemos visto:
# Lectura de ficheros
# Exploración

In [ ]:
# Hoy vamos a ver:
# Unión de datos
# Limpieza
# Filtrado/Selección
# ¿Orden? Depende

In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None)

In [2]:
df_bank = pd.read_csv("bank-additional.csv")

In [3]:
df_bank.head() #Unnamed es el índice

,Unnamed: 0,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [4]:
df_bank = pd.read_csv("bank-additional.csv", index_col = 0)
df_bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [5]:
df_2012 = pd.read_excel("customer-details.xlsx", sheet_name="2012", index_col = 0)
df_2013 = pd.read_excel("customer-details.xlsx", sheet_name="2013", index_col = 0)
df_2014 = pd.read_excel("customer-details.xlsx", sheet_name="2014", index_col = 0)

In [6]:
df_2012.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [7]:
df_2013.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,82407,0,1,2013-10-07,29,ef81336c-e41a-46d0-8a30-5d4ac3b836be
1,24877,0,0,2013-04-21,32,50b224ac-84b4-42a7-aba9-3e1d1d620479
2,78839,1,0,2013-11-25,21,9cb15c53-b647-464a-add9-09cdae04897c
3,113859,1,1,2013-01-06,12,f8aaf334-949d-4943-a214-b64fe9c088b4
4,147317,0,0,2013-07-10,14,885fe85a-3718-4760-a32a-a57628cf7528

In [ ]:
#¿Cómo querríamos unir estos df?

In [ ]:
#Método concat: para unir DataFrames
#pd.concat
#Primero vamos a ver el ejemplo con ficheros pequeñitos

In [8]:
df_2012_short = pd.DataFrame({'Año': [2012, 2012], 'Ventas': [100, 200], 'Previsión' : ['ok' , 'debajo']})
df_2013_short = pd.DataFrame({'Año': [2013, 2013], 'Ventas': [150, 250]})
df_2014_short = pd.DataFrame({'Año': [2014, 2014], 'Ventas': [300, 400]})

In [9]:
df_2012_short

    Año  Ventas Previsión
0  2012     100        ok
1  2012     200    debajo

In [10]:
df_2013_short

    Año  Ventas
0  2013     150
1  2013     250

In [11]:
df_2014_short

    Año  Ventas
0  2014     300
1  2014     400

In [ ]:
#Yo quiero ponerlo uno debajo de otro
#Utilizamos pd.concat que tiene un parámetro llamado join. Esto nos suena, ¿no?

In [12]:
df_años_short = pd.concat([df_2012_short, df_2013_short, df_2014_short], axis = 0, join = 'outer', ignore_index=True) 
#axis=0, es para unir por filas, es decir, uno de bajo de otro
#join: ahora veremos cómo funciona
#ignora_index = True para darle un índice nuevo, False para mantener el de las tablas originales
df_años_short

    Año  Ventas Previsión
0  2012     100        ok
1  2012     200    debajo
2  2013     150       NaN
3  2013     250       NaN
4  2014     300       NaN
5  2014     400       NaN

In [13]:
#¿Qué psa si hago axis 1?
df_años_axis1 = pd.concat([df_2012_short, df_2013_short, df_2014_short], axis = 1, ignore_index=True)
df_años_axis1

      0    1       2     3    4     5    6
0  2012  100      ok  2013  150  2014  300
1  2012  200  debajo  2013  250  2014  400

In [14]:
df_años_short = pd.concat([df_2012_short, df_2013_short, df_2014_short], axis = 0, join = 'inner', ignore_index=True) 
df_años_short

    Año  Ventas
0  2012     100
1  2012     200
2  2013     150
3  2013     250
4  2014     300
5  2014     400

In [15]:
#qué pasa si le pongo en ignore_index false?
df_años_short = pd.concat([df_2012_short, df_2013_short, df_2014_short], axis = 0, join = 'inner', ignore_index=False) 
df_años_short

    Año  Ventas
0  2012     100
1  2012     200
0  2013     150
1  2013     250
0  2014     300
1  2014     400

In [ ]:
#Ahora vamos a hacerlo con los archivos grandes

In [16]:
df_años = pd.concat([df_2012, df_2013, df_2014], axis = 0, ignore_index=True) 
# axis = 0 uno por filas
# ignore_inex = True para ignorar los índices originales y crear uno nuevo secuencial
# outer: incluye todas las columnas / inner incluye solo las columnas columnes
# Si no le pongo join, da por sentado que es inner
df_años.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth,ID
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

In [ ]:
# Merge: unimos dataframes por columnas en común. Esto nos suena de SQL. Esto ya no es uno debajo de otro.

In [21]:
df_bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude', 'id_'],
      dtype='object')

In [22]:
df_años.columns

Index(['Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'NumWebVisitsMonth',
       'ID'],
      dtype='object')

In [ ]:
#¿Hay alguna columna por la que podamos unir ambas tablas?

In [ ]:
#Vamos a querer unir ambas tablas... Y las opciones son como en SQL... Left, right e inner join.

In [ ]:
#La estructura es:
nombre_df_final = df1.merge(df2, left_on = columna por la que unir en la izquierda, right_on= columna por la que unir en la derecha)

In [16]:
merge_inner = df_años.merge(df_bank, left_on = 'ID', right_on = 'id_') #la tabla de la izquierda sigue siendo la primera

In [ ]:
#left_on = el nombre de la columna a unir de la tabla de la izquierda
#right_on = el nombre de la columna a unir de la tabla de la derecha
#Si no le ponemos nada, es un inner

In [ ]:
merge_inner.head()

In [28]:
df_años.shape

(43170, 6)

In [29]:
df_bank.shape

(43000, 23)

In [30]:
merge_inner.shape

(43000, 29)

In [ ]:
#¿Y si quiero mantener los registros de la primera tabla, la de años, aunque no estén en la segunda?
#Uso el parámetro how

In [ ]:
merge_left= df_años.merge(df_bank, how = 'left', left_on = 'ID', right_on = 'id_')
merge_left.head()

In [ ]:
merge_right= df_años.merge(df_bank, how = 'right', left_on = 'ID', right_on = 'id_')
merge_right.head()

In [ ]:
merge_outer= df_años.merge(df_bank, how = 'outer', left_on = 'ID', right_on = 'id_')
merge_outer.head()

In [ ]:
# concat -> unir df uno encima de otro
# merge -> unir df uno al lado de otro a través de columnas en común
# join -> unir df a través de índices, pero se usa mucho menos

In [30]:
df_bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude', 'id_'],
      dtype='object')

In [ ]:
#Vamos a convertir a ID y id_ en índices y luego vamos a unir las tablas por índice
#Primero vamos a renombrar id_ a ID
#Después pasaremos las columnas ID a índice
#Por último, usaremos JOIN para unir

In [28]:
df_bank.rename(columns = {'id_': 'ID'}, inplace = True)

In [29]:
df_bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude'],
      dtype='object')

In [17]:
df_bank.head(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b

In [18]:
df_bank.set_index(['ID'], inplace = True)
df_bank.head(2)

KeyError: "None of ['ID'] are in the columns"

In [ ]:
df_años.head()

In [30]:
df_años.set_index(['ID'], inplace = True)
df_años.head()

,Income,Kidhome,Teenhome,Dt_Customer,NumWebVisitsMonth
ID,,,,,
089b39d8-e4d0-461b-87d4-814d71e0e079,161770,1,0,2012-04-04,29
e9d37224-cb6f-4942-98d7-46672963d097,85477,1,1,2012-12-30,7
3f9f49b5-e410-4948-bf6e-f9244f04918b,147233,1,1,2012-02-02,5
9991fafb-4447-451a-8be2-b0df6098d13e,121393,1,2,2012-12-21,29
eca60b76-70b6-4077-80ba-bc52e8ebb0eb,63164,1,2,2012-06-20,20

In [ ]:
#Veamos cómo se unirían

In [ ]:
df_join = df_años.join(df_bank, on = 'ID') #Por defecto, realiza un left join
df_join.head()

In [ ]:
#si quisieramos hacer otro tipo de join, tendríamos que añadir el parámetro how = 'right' o 'outer'

# Limpieza

- Eliminar info redundante, duplicados, eliminar columnas con demasiados nulos
- Homegeneizar columnas: cambiar nombre o tipo de dato
- Limpieza o reemplazo de caracteres
- Creación de columnas nuevas, normalmente basadas en otras
- Gestión de nulos

In [ ]:
merge_inner

In [34]:
df_final = merge_inner.copy()

In [35]:
df_final.columns

Index(['Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'NumWebVisitsMonth',
       'ID', 'age', 'job', 'marital', 'education', 'default', 'housing',
       'loan', 'contact', 'duration', 'campaign', 'pdays', 'previous',
       'poutcome', 'emp.var.rate', 'cons.price.idx', 'cons.conf.idx',
       'euribor3m', 'nr.employed', 'y', 'date', 'latitude', 'longitude',
       'id_'],
      dtype='object')

In [41]:
# Eliminamos columnas redundantes, por ejemplo, al hacer el join, tengo dos columnas de id

df_final.drop("id_", axis = 1, inplace = True)
df_final.columns

Index(['Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'NumWebVisitsMonth',
       'ID', 'age', 'job', 'marital', 'education', 'default', 'housing',
       'loan', 'contact', 'duration', 'campaign', 'pdays', 'previous',
       'poutcome', 'emp.var.rate', 'cons.price.idx', 'cons.conf.idx',
       'euribor3m', 'nr.employed', 'y', 'date', 'latitude', 'longitude'],
      dtype='object')

In [42]:
# Homogeneizamos nombre de las columnas
# Esto es importante para la limpieza, para no tener inconsistencias
# En este caso, quiero todos los nombres de columnas en minúsculas

nuevas_columnas = {}

for col in df_final.columns:
    nuevas_columnas[col] = col.lower().replace(".", "")

nuevas_columnas

{'Income': 'income',
 'Kidhome': 'kidhome',
 'Teenhome': 'teenhome',
 'Dt_Customer': 'dt_customer',
 'NumWebVisitsMonth': 'numwebvisitsmonth',
 'ID': 'id',
 'age': 'age',
 'job': 'job',
 'marital': 'marital',
 'education': 'education',
 'default': 'default',
 'housing': 'housing',
 'loan': 'loan',
 'contact': 'contact',
 'duration': 'duration',
 'campaign': 'campaign',
 'pdays': 'pdays',
 'previous': 'previous',
 'poutcome': 'poutcome',
 'emp.var.rate': 'empvarrate',
 'cons.price.idx': 'conspriceidx',
 'cons.conf.idx': 'consconfidx',
 'euribor3m': 'euribor3m',
 'nr.employed': 'nremployed',
 'y': 'y',
 'date': 'date',
 'latitude': 'latitude',
 'longitude': 'longitude'}

In [ ]:
#Para cambiar nombre de columna usamos df.rename(columns = diccionario con nombre antiguo: nombre nuevo)
df_final.rename(columns = nuevas_columnas, inplace = True)
df_final.columns

In [ ]:
# Cambiar tipo de datos si fuera necesario

df_final.info() #Mirar cada uno si tiene sentido que sea de ese tipo de dato

In [ ]:
#¿Cómo se cambia el tipo de dato de una columna?
#Usamos el método .astype() y en algunos casos pd.to_datetime()
# Para empezar tenemos que saber de qué dato a qué dato podemos pasar
## int --> float, str, bool (0 sería False y los demás True)
## float --> int, str, bool (0.0 False y lo demás True)
## str --> int solo si son números válidos, float igual, bool (celdas vacías son False y las demás, True)
## bool --> int (True es 1 y False 0), float (1.0, 0.0), str ('True', 'False')

df['nombre_columna'] = df['nombre_columna'].astype(int)
df['nombre_columna'] = df['nombre_columna'].astype(str)
df['nombre_columna'] = df['nombre_columna'].astype(bool)
df['nombre_columna'] = pd.to_datetime(df['nombre_columna'])
df = df.astype({columna1: int, columna2:str})

#Convertir varias columnas a la vez
df = df.astype({'columna1': int, 'columna2': str})

In [44]:
#Ej, quiero el income como float
df_final['income'] = df_final['income'].astype(float)

In [ ]:
df_final.info()

In [ ]:
df_final.dtypes

In [ ]:
df_final.describe()

In [ ]:
df_final.describe().T
#count: num de valores no nulos
#media: promedio
#std: desviación estándar
#min: valor mínimo
#max: valor máximo
#25%: Primer cuartil, percentil 25
#50%: La mediana
#75%: Tercer cuartil, percentil 75

In [ ]:
for col in df_final.select_dtypes(include='object'):
    print(col)
    print('-----------------------------')
    print(df_final[col].unique())
    
#Me sirve para ver si está bien escrito, valores únicos, etc.

In [ ]:
# IMPORTANTE: No voy a limpiar columnas con las que no voy a trabajar...

In [ ]:
#¿Cómo podríamos modificar el texto de la info dentro de nuestras columnas?

In [50]:
df_final['marital'] = df_final['marital'].str.lower()
df_final['poutcome'] = df_final['poutcome'].str.lower()

In [51]:
df_final['education'] = df_final['education'].str.replace('.', " ")

In [55]:
df_final['date'] # A lo mejor no quiero esta fecha así, sino separar año y mes...

0             2-agosto-2019
1        14-septiembre-2016
2           15-febrero-2019
3         29-noviembre-2015
4             29-enero-2017
                ...
42995       13-octubre-2015
42996         17-marzo-2018
42997    15-septiembre-2016
42998    23-septiembre-2019
42999      6-noviembre-2019
Name: date, Length: 43000, dtype: object

In [76]:
df_final[["contact_month", "contact_year"]] = df_final["date"].str.split("-", expand = True).get([1,2])
#Expand me convierte el valor dividido por - en columnas, como si tuvieras tres columnas así: 2    agosto   2019
#get me coge los índices que yo le digo, en este caso el índice 1 y 2 son la segunda y tercera columna

In [ ]:
#También lo podemos hacer de otra forma, podemos usilizar dt.month o dt.year para obtener el mes y año de un datetime

In [ ]:
df_final["contact_month"] = df_final["date"].dt.month
df_final["contact_year"] = df_final["date"].dt.year

In [ ]:
df_final.head()

In [ ]:
df_final.to_csv("df_final_limpieza.csv", index=False) #cómo guardar el resultado
#index_False se usa para evitar que se guarde el índice de las filas en el csv, si no lo incluimos,
# pandas agregará una columna extra al principio de csv con una secuencia de números

## Filtrado

### ==
### .isin()
### .between()
### .str.contains()

In [ ]:
df_final['marital'].unique()

In [ ]:
#Imaginaos que solo me quiero quedar con married
cond_married = df_final['marital'] == 'married'

In [ ]:
#He creado una condición, a ver qué me devuelve

In [ ]:
cond_married

In [ ]:
#Si yo esta condición se la paso a la columna marital, ¿qué me va a hacer?

In [ ]:
df_married = df_final[df_final['marital'] == 'married']
df_married = df_final[cond_married] 
#Ambas opciones son lo mismo

In [ ]:
df_married = df_final[df_final['marital'] == 'married']

In [ ]:
df_married["marital"].unique()

In [ ]:
# Ahora quiero que de income solo se quede con los que son más de 15000
# Y voy a guardar el resultado en un df nuevo

condicion_income = df_final["income"] > 150000

# Primero creo la condición

In [ ]:
# Creo un nuevo dataframe basado en esa condición
df_income_150 = df_final[condicion_income]

In [ ]:
# A ver si me ha funcionado
df_income_150["income"].min()

In [ ]:
#Ahora quiero un df nuevo donde salgan las personas casadas y con un income de más de 150000

In [ ]:
df_income_casados = df_final[cond_married & condicion_income]
df_income_casados.head(2)

In [57]:
# .isin(), lo utilizo para un filtro con varias opciones, parecido al IN en SQL

df_final["education"].unique()

array(['basic 4y', 'high school', 'basic 6y', 'basic 9y',
       'professional course', nan, 'university degree', 'illiterate'],
      dtype=object)

In [60]:
filtro_educacion = ['basic 6y', 'basic 9y']

In [61]:
# aplicamos el método 'isin()' pasando la lista
df_educacion = df_final[df_final["education"].isin(filtro_educacion)]

In [62]:
# comprobamos que ahora solo tenemos dos valores únicos para la columna ' education'
df_educacion["education"].unique()

array(['basic 6y', 'basic 9y'], dtype=object)

In [ ]:
# .between(), como el BETWEEN en SQL

# clientes que han visitado la página entre 15 y 20 veces, ambos incluidos
df_web = df_final[df_final["numwebvisitsmonth"].between(15, 25)]
df_web.head()

In [ ]:
#Por último, .str.containts(), busca palabras o caracteres en una columna de texto

In [65]:
df_basic = df_final[df_final['education'].str.contains('basic', na=False)] #CUIDADO, si tiene nulos, nos dará error, para ignorar los nulos, usamos na=False

In [66]:
df_basic['education'].unique()

array(['basic 4y', 'basic 6y', 'basic 9y'], dtype=object)

In [ ]:
# data sets para practicar
# https://www.kaggle.com/datasets
# https://archive.ics.uci.edu/